       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHAREVAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8).
       PROCEDURE DIVISION.
           MOVE 'PROGA001' TO TARGET-NAME.
           PERFORM ROUTINE-A.
           CALL TARGET-NAME.
           MOVE 'PROGB001' TO TARGET-NAME.
           PERFORM ROUTINE-A.
           CALL TARGET-NAME.
           GOBACK.
       ROUTINE-A.
           CALL TARGET-NAME.
