       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHAREFILE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FILE-NAME PIC X(8).
       PROCEDURE DIVISION.
           MOVE 'ACCOUNT' TO FILE-NAME.
           PERFORM END-SCAN.
           MOVE 'CUSTOMER' TO FILE-NAME.
           PERFORM END-SCAN.
           GOBACK.
       END-SCAN.
           EXEC CICS ENDBR FILE(FILE-NAME) NOHANDLE END-EXEC.
