       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHARECIC.
       PROCEDURE DIVISION.
           PERFORM ROUTINE-A.
           PERFORM ROUTINE-A.
           EXEC CICS LINK PROGRAM('AFTERPGM') END-EXEC.
           GOBACK.
       ROUTINE-A.
           CONTINUE.
