000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COPY-DEMO.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-PGM PIC X(8).
000600 PROCEDURE DIVISION.
000700 MAIN.
000800     COPY CALLPART.
000900     GOBACK.
