000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. LARGE-ROUTER.
000003 DATA DIVISION.
000004 WORKING-STORAGE SECTION.
000005 01 FLAG PIC X.
000006 01 WS-PGM PIC X(8).
000007 PROCEDURE DIVISION.
000008 P-000.
000009 MOVE 'SRV000' TO WS-PGM.
000010 IF FLAG = 'Y'
000011     GO TO P-002
000012 END-IF.
000013 CALL WS-PGM.
000014 GO TO P-001.
000015 P-001.
000016 MOVE 'SRV001' TO WS-PGM.
000017 IF FLAG = 'Y'
000018     GO TO P-003
000019 END-IF.
000020 CALL WS-PGM.
000021 GO TO P-002.
000022 P-002.
000023 MOVE 'SRV002' TO WS-PGM.
000024 IF FLAG = 'Y'
000025     GO TO P-004
000026 END-IF.
000027 CALL WS-PGM.
000028 GO TO P-003.
000029 P-003.
000030 MOVE 'SRV003' TO WS-PGM.
000031 IF FLAG = 'Y'
000032     GO TO P-005
000033 END-IF.
000034 CALL WS-PGM.
000035 GO TO P-004.
000036 P-004.
000037 MOVE 'SRV004' TO WS-PGM.
000038 IF FLAG = 'Y'
000039     GO TO P-006
000040 END-IF.
000041 CALL WS-PGM.
000042 GO TO P-005.
000043 P-005.
000044 MOVE 'SRV005' TO WS-PGM.
000045 IF FLAG = 'Y'
000046     GO TO P-007
000047 END-IF.
000048 CALL WS-PGM.
000049 GO TO P-006.
000050 P-006.
000051 MOVE 'SRV006' TO WS-PGM.
000052 IF FLAG = 'Y'
000053     GO TO P-008
000054 END-IF.
000055 CALL WS-PGM.
000056 GO TO P-007.
000057 P-007.
000058 MOVE 'SRV007' TO WS-PGM.
000059 IF FLAG = 'Y'
000060     GO TO P-009
000061 END-IF.
000062 CALL WS-PGM.
000063 GO TO P-008.
000064 P-008.
000065 MOVE 'SRV008' TO WS-PGM.
000066 IF FLAG = 'Y'
000067     GO TO P-010
000068 END-IF.
000069 CALL WS-PGM.
000070 GO TO P-009.
000071 P-009.
000072 MOVE 'SRV009' TO WS-PGM.
000073 IF FLAG = 'Y'
000074     GO TO P-011
000075 END-IF.
000076 CALL WS-PGM.
000077 GO TO P-010.
000078 P-010.
000079 MOVE 'SRV010' TO WS-PGM.
000080 IF FLAG = 'Y'
000081     GO TO P-012
000082 END-IF.
000083 CALL WS-PGM.
000084 GO TO P-011.
000085 P-011.
000086 MOVE 'SRV011' TO WS-PGM.
000087 IF FLAG = 'Y'
000088     GO TO P-013
000089 END-IF.
000090 CALL WS-PGM.
000091 GO TO P-012.
000092 P-012.
000093 MOVE 'SRV012' TO WS-PGM.
000094 IF FLAG = 'Y'
000095     GO TO P-014
000096 END-IF.
000097 CALL WS-PGM.
000098 GO TO P-013.
000099 P-013.
000100 MOVE 'SRV013' TO WS-PGM.
000101 IF FLAG = 'Y'
000102     GO TO P-015
000103 END-IF.
000104 CALL WS-PGM.
000105 GO TO P-014.
000106 P-014.
000107 MOVE 'SRV014' TO WS-PGM.
000108 IF FLAG = 'Y'
000109     GO TO P-016
000110 END-IF.
000111 CALL WS-PGM.
000112 GO TO P-015.
000113 P-015.
000114 MOVE 'SRV015' TO WS-PGM.
000115 IF FLAG = 'Y'
000116     GO TO P-017
000117 END-IF.
000118 CALL WS-PGM.
000119 GO TO P-016.
000120 P-016.
000121 MOVE 'SRV016' TO WS-PGM.
000122 IF FLAG = 'Y'
000123     GO TO P-018
000124 END-IF.
000125 CALL WS-PGM.
000126 GO TO P-017.
000127 P-017.
000128 MOVE 'SRV017' TO WS-PGM.
000129 IF FLAG = 'Y'
000130     GO TO P-019
000131 END-IF.
000132 CALL WS-PGM.
000133 GO TO P-018.
000134 P-018.
000135 MOVE 'SRV018' TO WS-PGM.
000136 IF FLAG = 'Y'
000137     GO TO P-020
000138 END-IF.
000139 CALL WS-PGM.
000140 GO TO P-019.
000141 P-019.
000142 MOVE 'SRV019' TO WS-PGM.
000143 IF FLAG = 'Y'
000144     GO TO P-021
000145 END-IF.
000146 CALL WS-PGM.
000147 GO TO P-020.
000148 P-020.
000149 MOVE 'SRV020' TO WS-PGM.
000150 IF FLAG = 'Y'
000151     GO TO P-022
000152 END-IF.
000153 CALL WS-PGM.
000154 GO TO P-021.
000155 P-021.
000156 MOVE 'SRV021' TO WS-PGM.
000157 IF FLAG = 'Y'
000158     GO TO P-023
000159 END-IF.
000160 CALL WS-PGM.
000161 GO TO P-022.
000162 P-022.
000163 MOVE 'SRV022' TO WS-PGM.
000164 IF FLAG = 'Y'
000165     GO TO P-024
000166 END-IF.
000167 CALL WS-PGM.
000168 GO TO P-023.
000169 P-023.
000170 MOVE 'SRV023' TO WS-PGM.
000171 IF FLAG = 'Y'
000172     GO TO P-025
000173 END-IF.
000174 CALL WS-PGM.
000175 GO TO P-024.
000176 P-024.
000177 MOVE 'SRV024' TO WS-PGM.
000178 IF FLAG = 'Y'
000179     GO TO P-026
000180 END-IF.
000181 CALL WS-PGM.
000182 GO TO P-025.
000183 P-025.
000184 MOVE 'SRV025' TO WS-PGM.
000185 IF FLAG = 'Y'
000186     GO TO P-027
000187 END-IF.
000188 CALL WS-PGM.
000189 GO TO P-026.
000190 P-026.
000191 MOVE 'SRV026' TO WS-PGM.
000192 IF FLAG = 'Y'
000193     GO TO P-028
000194 END-IF.
000195 CALL WS-PGM.
000196 GO TO P-027.
000197 P-027.
000198 MOVE 'SRV027' TO WS-PGM.
000199 IF FLAG = 'Y'
000200     GO TO P-029
000201 END-IF.
000202 CALL WS-PGM.
000203 GO TO P-028.
000204 P-028.
000205 MOVE 'SRV028' TO WS-PGM.
000206 IF FLAG = 'Y'
000207     GO TO P-030
000208 END-IF.
000209 CALL WS-PGM.
000210 GO TO P-029.
000211 P-029.
000212 MOVE 'SRV029' TO WS-PGM.
000213 IF FLAG = 'Y'
000214     GO TO P-031
000215 END-IF.
000216 CALL WS-PGM.
000217 GO TO P-030.
000218 P-030.
000219 MOVE 'SRV030' TO WS-PGM.
000220 IF FLAG = 'Y'
000221     GO TO P-032
000222 END-IF.
000223 CALL WS-PGM.
000224 GO TO P-031.
000225 P-031.
000226 MOVE 'SRV031' TO WS-PGM.
000227 IF FLAG = 'Y'
000228     GO TO P-033
000229 END-IF.
000230 CALL WS-PGM.
000231 GO TO P-032.
000232 P-032.
000233 MOVE 'SRV032' TO WS-PGM.
000234 IF FLAG = 'Y'
000235     GO TO P-034
000236 END-IF.
000237 CALL WS-PGM.
000238 GO TO P-033.
000239 P-033.
000240 MOVE 'SRV033' TO WS-PGM.
000241 IF FLAG = 'Y'
000242     GO TO P-035
000243 END-IF.
000244 CALL WS-PGM.
000245 GO TO P-034.
000246 P-034.
000247 MOVE 'SRV034' TO WS-PGM.
000248 IF FLAG = 'Y'
000249     GO TO P-036
000250 END-IF.
000251 CALL WS-PGM.
000252 GO TO P-035.
000253 P-035.
000254 MOVE 'SRV035' TO WS-PGM.
000255 IF FLAG = 'Y'
000256     GO TO P-037
000257 END-IF.
000258 CALL WS-PGM.
000259 GO TO P-036.
000260 P-036.
000261 MOVE 'SRV036' TO WS-PGM.
000262 IF FLAG = 'Y'
000263     GO TO P-038
000264 END-IF.
000265 CALL WS-PGM.
000266 GO TO P-037.
000267 P-037.
000268 MOVE 'SRV037' TO WS-PGM.
000269 IF FLAG = 'Y'
000270     GO TO P-039
000271 END-IF.
000272 CALL WS-PGM.
000273 GO TO P-038.
000274 P-038.
000275 MOVE 'SRV038' TO WS-PGM.
000276 IF FLAG = 'Y'
000277     GO TO P-040
000278 END-IF.
000279 CALL WS-PGM.
000280 GO TO P-039.
000281 P-039.
000282 MOVE 'SRV039' TO WS-PGM.
000283 IF FLAG = 'Y'
000284     GO TO P-041
000285 END-IF.
000286 CALL WS-PGM.
000287 GO TO P-040.
000288 P-040.
000289 MOVE 'SRV040' TO WS-PGM.
000290 IF FLAG = 'Y'
000291     GO TO P-042
000292 END-IF.
000293 CALL WS-PGM.
000294 GO TO P-041.
000295 P-041.
000296 MOVE 'SRV041' TO WS-PGM.
000297 IF FLAG = 'Y'
000298     GO TO P-043
000299 END-IF.
000300 CALL WS-PGM.
000301 GO TO P-042.
000302 P-042.
000303 MOVE 'SRV042' TO WS-PGM.
000304 IF FLAG = 'Y'
000305     GO TO P-044
000306 END-IF.
000307 CALL WS-PGM.
000308 GO TO P-043.
000309 P-043.
000310 MOVE 'SRV043' TO WS-PGM.
000311 IF FLAG = 'Y'
000312     GO TO P-045
000313 END-IF.
000314 CALL WS-PGM.
000315 GO TO P-044.
000316 P-044.
000317 MOVE 'SRV044' TO WS-PGM.
000318 IF FLAG = 'Y'
000319     GO TO P-046
000320 END-IF.
000321 CALL WS-PGM.
000322 GO TO P-045.
000323 P-045.
000324 MOVE 'SRV045' TO WS-PGM.
000325 IF FLAG = 'Y'
000326     GO TO P-047
000327 END-IF.
000328 CALL WS-PGM.
000329 GO TO P-046.
000330 P-046.
000331 MOVE 'SRV046' TO WS-PGM.
000332 IF FLAG = 'Y'
000333     GO TO P-048
000334 END-IF.
000335 CALL WS-PGM.
000336 GO TO P-047.
000337 P-047.
000338 MOVE 'SRV047' TO WS-PGM.
000339 IF FLAG = 'Y'
000340     GO TO P-049
000341 END-IF.
000342 CALL WS-PGM.
000343 GO TO P-048.
000344 P-048.
000345 MOVE 'SRV048' TO WS-PGM.
000346 IF FLAG = 'Y'
000347     GO TO P-050
000348 END-IF.
000349 CALL WS-PGM.
000350 GO TO P-049.
000351 P-049.
000352 MOVE 'SRV049' TO WS-PGM.
000353 IF FLAG = 'Y'
000354     GO TO P-051
000355 END-IF.
000356 CALL WS-PGM.
000357 GO TO P-050.
000358 P-050.
000359 MOVE 'SRV050' TO WS-PGM.
000360 IF FLAG = 'Y'
000361     GO TO P-052
000362 END-IF.
000363 CALL WS-PGM.
000364 GO TO P-051.
000365 P-051.
000366 MOVE 'SRV051' TO WS-PGM.
000367 IF FLAG = 'Y'
000368     GO TO P-053
000369 END-IF.
000370 CALL WS-PGM.
000371 GO TO P-052.
000372 P-052.
000373 MOVE 'SRV052' TO WS-PGM.
000374 IF FLAG = 'Y'
000375     GO TO P-054
000376 END-IF.
000377 CALL WS-PGM.
000378 GO TO P-053.
000379 P-053.
000380 MOVE 'SRV053' TO WS-PGM.
000381 IF FLAG = 'Y'
000382     GO TO P-055
000383 END-IF.
000384 CALL WS-PGM.
000385 GO TO P-054.
000386 P-054.
000387 MOVE 'SRV054' TO WS-PGM.
000388 IF FLAG = 'Y'
000389     GO TO P-056
000390 END-IF.
000391 CALL WS-PGM.
000392 GO TO P-055.
000393 P-055.
000394 MOVE 'SRV055' TO WS-PGM.
000395 IF FLAG = 'Y'
000396     GO TO P-057
000397 END-IF.
000398 CALL WS-PGM.
000399 GO TO P-056.
000400 P-056.
000401 MOVE 'SRV056' TO WS-PGM.
000402 IF FLAG = 'Y'
000403     GO TO P-058
000404 END-IF.
000405 CALL WS-PGM.
000406 GO TO P-057.
000407 P-057.
000408 MOVE 'SRV057' TO WS-PGM.
000409 IF FLAG = 'Y'
000410     GO TO P-059
000411 END-IF.
000412 CALL WS-PGM.
000413 GO TO P-058.
000414 P-058.
000415 MOVE 'SRV058' TO WS-PGM.
000416 IF FLAG = 'Y'
000417     GO TO P-060
000418 END-IF.
000419 CALL WS-PGM.
000420 GO TO P-059.
000421 P-059.
000422 MOVE 'SRV059' TO WS-PGM.
000423 IF FLAG = 'Y'
000424     GO TO P-061
000425 END-IF.
000426 CALL WS-PGM.
000427 GO TO P-060.
000428 P-060.
000429 MOVE 'SRV060' TO WS-PGM.
000430 IF FLAG = 'Y'
000431     GO TO P-062
000432 END-IF.
000433 CALL WS-PGM.
000434 GO TO P-061.
000435 P-061.
000436 MOVE 'SRV061' TO WS-PGM.
000437 IF FLAG = 'Y'
000438     GO TO P-063
000439 END-IF.
000440 CALL WS-PGM.
000441 GO TO P-062.
000442 P-062.
000443 MOVE 'SRV062' TO WS-PGM.
000444 IF FLAG = 'Y'
000445     GO TO P-064
000446 END-IF.
000447 CALL WS-PGM.
000448 GO TO P-063.
000449 P-063.
000450 MOVE 'SRV063' TO WS-PGM.
000451 IF FLAG = 'Y'
000452     GO TO P-065
000453 END-IF.
000454 CALL WS-PGM.
000455 GO TO P-064.
000456 P-064.
000457 MOVE 'SRV064' TO WS-PGM.
000458 IF FLAG = 'Y'
000459     GO TO P-066
000460 END-IF.
000461 CALL WS-PGM.
000462 GO TO P-065.
000463 P-065.
000464 MOVE 'SRV065' TO WS-PGM.
000465 IF FLAG = 'Y'
000466     GO TO P-067
000467 END-IF.
000468 CALL WS-PGM.
000469 GO TO P-066.
000470 P-066.
000471 MOVE 'SRV066' TO WS-PGM.
000472 IF FLAG = 'Y'
000473     GO TO P-068
000474 END-IF.
000475 CALL WS-PGM.
000476 GO TO P-067.
000477 P-067.
000478 MOVE 'SRV067' TO WS-PGM.
000479 IF FLAG = 'Y'
000480     GO TO P-069
000481 END-IF.
000482 CALL WS-PGM.
000483 GO TO P-068.
000484 P-068.
000485 MOVE 'SRV068' TO WS-PGM.
000486 IF FLAG = 'Y'
000487     GO TO P-070
000488 END-IF.
000489 CALL WS-PGM.
000490 GO TO P-069.
000491 P-069.
000492 MOVE 'SRV069' TO WS-PGM.
000493 IF FLAG = 'Y'
000494     GO TO P-071
000495 END-IF.
000496 CALL WS-PGM.
000497 GO TO P-070.
000498 P-070.
000499 MOVE 'SRV070' TO WS-PGM.
000500 IF FLAG = 'Y'
000501     GO TO P-072
000502 END-IF.
000503 CALL WS-PGM.
000504 GO TO P-071.
000505 P-071.
000506 MOVE 'SRV071' TO WS-PGM.
000507 IF FLAG = 'Y'
000508     GO TO P-073
000509 END-IF.
000510 CALL WS-PGM.
000511 GO TO P-072.
000512 P-072.
000513 MOVE 'SRV072' TO WS-PGM.
000514 IF FLAG = 'Y'
000515     GO TO P-074
000516 END-IF.
000517 CALL WS-PGM.
000518 GO TO P-073.
000519 P-073.
000520 MOVE 'SRV073' TO WS-PGM.
000521 IF FLAG = 'Y'
000522     GO TO P-075
000523 END-IF.
000524 CALL WS-PGM.
000525 GO TO P-074.
000526 P-074.
000527 MOVE 'SRV074' TO WS-PGM.
000528 IF FLAG = 'Y'
000529     GO TO P-076
000530 END-IF.
000531 CALL WS-PGM.
000532 GO TO P-075.
000533 P-075.
000534 MOVE 'SRV075' TO WS-PGM.
000535 IF FLAG = 'Y'
000536     GO TO P-077
000537 END-IF.
000538 CALL WS-PGM.
000539 GO TO P-076.
000540 P-076.
000541 MOVE 'SRV076' TO WS-PGM.
000542 IF FLAG = 'Y'
000543     GO TO P-078
000544 END-IF.
000545 CALL WS-PGM.
000546 GO TO P-077.
000547 P-077.
000548 MOVE 'SRV077' TO WS-PGM.
000549 IF FLAG = 'Y'
000550     GO TO P-079
000551 END-IF.
000552 CALL WS-PGM.
000553 GO TO P-078.
000554 P-078.
000555 MOVE 'SRV078' TO WS-PGM.
000556 IF FLAG = 'Y'
000557     GO TO P-080
000558 END-IF.
000559 CALL WS-PGM.
000560 GO TO P-079.
000561 P-079.
000562 MOVE 'SRV079' TO WS-PGM.
000563 IF FLAG = 'Y'
000564     GO TO P-081
000565 END-IF.
000566 CALL WS-PGM.
000567 GO TO P-080.
000568 P-080.
000569 MOVE 'SRV080' TO WS-PGM.
000570 IF FLAG = 'Y'
000571     GO TO P-082
000572 END-IF.
000573 CALL WS-PGM.
000574 GO TO P-081.
000575 P-081.
000576 MOVE 'SRV081' TO WS-PGM.
000577 IF FLAG = 'Y'
000578     GO TO P-083
000579 END-IF.
000580 CALL WS-PGM.
000581 GO TO P-082.
000582 P-082.
000583 MOVE 'SRV082' TO WS-PGM.
000584 IF FLAG = 'Y'
000585     GO TO P-084
000586 END-IF.
000587 CALL WS-PGM.
000588 GO TO P-083.
000589 P-083.
000590 MOVE 'SRV083' TO WS-PGM.
000591 IF FLAG = 'Y'
000592     GO TO P-085
000593 END-IF.
000594 CALL WS-PGM.
000595 GO TO P-084.
000596 P-084.
000597 MOVE 'SRV084' TO WS-PGM.
000598 IF FLAG = 'Y'
000599     GO TO P-086
000600 END-IF.
000601 CALL WS-PGM.
000602 GO TO P-085.
000603 P-085.
000604 MOVE 'SRV085' TO WS-PGM.
000605 IF FLAG = 'Y'
000606     GO TO P-087
000607 END-IF.
000608 CALL WS-PGM.
000609 GO TO P-086.
000610 P-086.
000611 MOVE 'SRV086' TO WS-PGM.
000612 IF FLAG = 'Y'
000613     GO TO P-088
000614 END-IF.
000615 CALL WS-PGM.
000616 GO TO P-087.
000617 P-087.
000618 MOVE 'SRV087' TO WS-PGM.
000619 IF FLAG = 'Y'
000620     GO TO P-089
000621 END-IF.
000622 CALL WS-PGM.
000623 GO TO P-088.
000624 P-088.
000625 MOVE 'SRV088' TO WS-PGM.
000626 IF FLAG = 'Y'
000627     GO TO P-090
000628 END-IF.
000629 CALL WS-PGM.
000630 GO TO P-089.
000631 P-089.
000632 MOVE 'SRV089' TO WS-PGM.
000633 IF FLAG = 'Y'
000634     GO TO P-091
000635 END-IF.
000636 CALL WS-PGM.
000637 GO TO P-090.
000638 P-090.
000639 MOVE 'SRV090' TO WS-PGM.
000640 IF FLAG = 'Y'
000641     GO TO P-092
000642 END-IF.
000643 CALL WS-PGM.
000644 GO TO P-091.
000645 P-091.
000646 MOVE 'SRV091' TO WS-PGM.
000647 IF FLAG = 'Y'
000648     GO TO P-093
000649 END-IF.
000650 CALL WS-PGM.
000651 GO TO P-092.
000652 P-092.
000653 MOVE 'SRV092' TO WS-PGM.
000654 IF FLAG = 'Y'
000655     GO TO P-094
000656 END-IF.
000657 CALL WS-PGM.
000658 GO TO P-093.
000659 P-093.
000660 MOVE 'SRV093' TO WS-PGM.
000661 IF FLAG = 'Y'
000662     GO TO P-095
000663 END-IF.
000664 CALL WS-PGM.
000665 GO TO P-094.
000666 P-094.
000667 MOVE 'SRV094' TO WS-PGM.
000668 IF FLAG = 'Y'
000669     GO TO P-096
000670 END-IF.
000671 CALL WS-PGM.
000672 GO TO P-095.
000673 P-095.
000674 MOVE 'SRV095' TO WS-PGM.
000675 IF FLAG = 'Y'
000676     GO TO P-097
000677 END-IF.
000678 CALL WS-PGM.
000679 GO TO P-096.
000680 P-096.
000681 MOVE 'SRV096' TO WS-PGM.
000682 IF FLAG = 'Y'
000683     GO TO P-098
000684 END-IF.
000685 CALL WS-PGM.
000686 GO TO P-097.
000687 P-097.
000688 MOVE 'SRV097' TO WS-PGM.
000689 IF FLAG = 'Y'
000690     GO TO P-099
000691 END-IF.
000692 CALL WS-PGM.
000693 GO TO P-098.
000694 P-098.
000695 MOVE 'SRV098' TO WS-PGM.
000696 IF FLAG = 'Y'
000697     GO TO P-100
000698 END-IF.
000699 CALL WS-PGM.
000700 GO TO P-099.
000701 P-099.
000702 MOVE 'SRV099' TO WS-PGM.
000703 IF FLAG = 'Y'
000704     GO TO P-100
000705 END-IF.
000706 CALL WS-PGM.
000707 GO TO P-100.
000708 P-100.
000709 GOBACK.
