       IDENTIFICATION DIVISION.
       PROGRAM-ID. OUTER-PROGRAM.
       PROCEDURE DIVISION.
       MAIN.
           CALL 'SERVICEA'.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. INNER-PROGRAM.
       PROCEDURE DIVISION.
       MAIN.
           CALL 'SERVICEB'.
           GOBACK.
       END PROGRAM INNER-PROGRAM.
       END PROGRAM OUTER-PROGRAM.
