       IDENTIFICATION DIVISION.
       PROGRAM-ID. CICS-COPY-FRONTIER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MAP-NAME PIC X(8) VALUE 'TESTMAP'.
       01 MAPSET-NAME PIC X(8) VALUE 'TESTSET'.
       01 RESPONSE-CODE PIC S9(8) COMP.
       01 FILE-NAME PIC X(8) VALUE 'ACCOUNTS'.
       01 RECORD-KEY PIC X(8) VALUE '00000001'.
       COPY HOSTCTX.
       01 MAP-BUFFER PIC X(80).
       01 FILE-BUFFER PIC X(80).
       PROCEDURE DIVISION.
       MAIN.
           EXEC CICS RECEIVE MAP(MAP-NAME)
                MAPSET(MAPSET-NAME)
                INTO(MAP-BUFFER)
                RESP(RESPONSE-CODE)
           END-EXEC.
           EXEC CICS READ FILE(FILE-NAME)
                INTO(FILE-BUFFER)
                RIDFLD(RECORD-KEY)
                RESP(RESPONSE-CODE)
           END-EXEC.
           GOBACK.
